# pandas数据读取
Pandas I/O API是一套像pd.read_csv()一样返回Pandas对象的顶级读取器函数。
读取文本文件(或平面文件)的两个主要功能是read_csv()和read_table()。它们都使用相同的解析代码来智能地将表格数据转换为DataFrame对象

语法：
pandas.read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer',names=None, index_col=None, usecols=None)

In [67]:
#引入模块
import pandas as pd

# read_csv

In [68]:
# 从csv文件中读取数据并创建一个DataFrame对象
df = pd.read_csv('data01.csv')
df

    name  age  score
0    joe   18     80
1  susan   19     85
2  merry   20     90
3  black   21     95

# 自定义索引

In [69]:
#可以指定csv文件中的一列来使用index_col定制索引。
df=pd.read_csv("data01.csv",index_col=['name'])
df

       age  score
name
joe     18     80
susan   19     85
merry   20     90
black   21     95

# header_names

In [70]:
#用names参数指定标题的名称
df=pd.read_csv("data01.csv",names=['a','b'])
df

         a      b
name   age  score
joe     18     80
susan   19     85
merry   20     90
black   21     95

In [71]:
#观察可以看到，标题名称附加了自定义名称，但文件中的标题还没有被消除。 现在，使用header参数来删除它。
df=pd.read_csv("data01.csv",names=['age','score'],header = 0)
df

       age  score
joe     18     80
susan   19     85
merry   20     90
black   21     95

# skiprows

In [72]:
#skiprows跳过指定的行数
df=pd.read_csv("data01.csv",skiprows = 2)
df

   susan  19  85
0  merry  20  90
1  black  21  95

# 读取文本数据

In [88]:
df = pd.read_csv('data2.txt',sep=':',header = None)
df

       0   1   2   3     4
0    joe  18  80  90  70.0
1  susan  19  80  88  90.0
2  merry  20  70  90   NaN
3  black  21  88  90  89.0

# 数据过滤获取

In [91]:
#添加列名
columns = ['name','age','语文','数学','英语']
df.columns = columns
df

    name  age  语文  数学    英语
0    joe   18  80  90  70.0
1  susan   19  80  88  90.0
2  merry   20  70  90   NaN
3  black   21  88  90  89.0

In [92]:
df.columns

Index(['name', 'age', '语文', '数学', '英语'], dtype='object')

In [93]:
df[['语文','数学','英语']]

   语文  数学    英语
0  80  90  70.0
1  80  88  90.0
2  70  90   NaN
3  88  90  89.0

In [94]:
df = df[columns[2:]]
df

   语文  数学    英语
0  80  90  70.0
1  80  88  90.0
2  70  90   NaN
3  88  90  89.0

# 删除NaN行

In [95]:
df = df.dropna()
df

   语文  数学    英语
0  80  90  70.0
1  80  88  90.0
3  88  90  89.0

In [101]:
aaa = pd.read_csv('E:\\bbb.csv', sep=' ',header = None)
aaa

,0,1,2,3,4,5,6
0,234324:1,32432:1,34324532:1,2342354:1,432432:1,42343214:1,21321321:1
1,213213211:1,23432432:1,4326543:1,5345354:1,324234:1,NaN,NaN
2,435324:1,234234:1,324324:1,234324:1,NaN,NaN,NaN